#-*- coding: utf-8 -*-

"""
Вхідні дані: рядок, передається в програму як аргумент командного рядка. Може містити пробіли, літери латинського алфавіту в будь-якому регістрі та цифри. Для передачі одним значенням рядок, що містить пробіли, береться в подвійні лапки.

Результат роботи: рядок "YES", якщо отриманий рядок є паліндромом, або "NO" - якщо ні. Рядок вважається паліндромом, якщо він однаково читається як зліва направо, так і справа наліво. Відмінністю регістрів та пробілами знехтувати.

Наприклад
Вхідні дані: 0
Приклад виклику: python lab4_1.py 0
Результат: YES
Вхідні дані: puppy
Приклад виклику: python lab4_1.py puppy
Результат: NO
Вхідні дані: "mystring1Gni rts ym"
Приклад виклику: python lab4_1.py "mystring1Gni rts ym"
Результат: YES
"""


import sys

a = sys.argv[1].lower()
b = []
c = []

for i in range (len(a)):
    if a[i].isalpha() or a[i].isdigit():
        b.append(a[i])
c = b[::-1]
if c == b:
    print "YES"
else:
    print "NO" 
