#-*- coding: utf-8 -*-

"""
Розробити функцію count_holes(n), 
яка приймає 1 аргумент -- ціле число або рядок, який містить ціле число, 
та повертає ціле число -- кількість "отворів" у десятковому записі цього числа друкованими цифрами (вважати, що у "4" та у "0" по одному отвору), або рядок ERROR, якщо переданий аргумент не задовольняє вимогам: є дійсним або взагалі не числом.

пояснення щодо отворів в цифрах

Незначущими нулями на початку запису числа, якщо такі є, нехтувати.

Наприклад
Виклик функціїі: count_holes('123')
Повертає: 0
Виклик функціїі: count_holes(906)
Повертає: 3
Виклик функціїі: count_holes('001')
Повертає: 0
Виклик функціїі: count_holes(-8)
Повертає: 2
Виклик функціїі: count_holes(-8.0)
Повертає: ERROR
"""




def count_holes(n):
	if type(n)!=float and type(n)!=list and n is not None:
		try:
			n_int = int(n)
			n_str = str(abs(n_int))
			b = {0:1, 4:1, 6:1, 8:2, 9:1}
			sum_b=0
			for i in n_str:
				sum_b=sum_b+int(b.get(int(i), 0))
			return sum_b
		
		except ValueError:
			return "ERROR"
	
	else:
		return "ERROR"
